app/controllers/application_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def current_student
      @current_student ||= Student.find(session[:student_id]) if session[:student_id]

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def current_company
      @current_company ||= Company.find(session[:company_id]) if session[:company_id]