app/controllers/companies_controller.rb

INSERT INTO "companies" ("compName", "hrName", "contactNumber", "compPostalAddress", "email", "website", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @company = Company.new(company_params)
      if @company.save

UPDATE "companies" SET "compName" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "companies"."id" = $4  [["compName", "wipro"], ["password_digest", "$2a$12$0kbF1GmxntLJuQOY0wt69.91uys30.K1JgIOVH/0JDsX1QqvMc0PC"], ["updated_at", "2019-06-19 07:41:50.240827"], ["id", 1]]
---
  def update
      if @company.update(company_params)