app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams"
---
  def index
    @exams = Exam.all