app/controllers/sessions_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "abhishekseth1.3344@gmail.com"], ["LIMIT", 1]]
---
     def create
       student = Student.find_by(email: params[:session][:email])