app/controllers/sessions1_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."email" = $1 LIMIT $2  [["email", "abhishekseth.3344@gmail.com"], ["LIMIT", 1]]
---
     def create
       company = Company.find_by(email: params[:session][:email])